content/man/man1/git-update-server-info.1.org
#+TITLE: Manpages - git-update-server-info.1
* NAME
git-update-server-info - Update auxiliary info file to help dumb servers

* SYNOPSIS
#+begin_example
git update-server-info [-f | --force]
#+end_example

* DESCRIPTION
A dumb server that does not do on-the-fly pack generations must have
some auxiliary information files in $GIT_DIR/info and
$GIT_OBJECT_DIRECTORY/info directories to help clients discover what
references and packs the server has. This command generates such
auxiliary files.

* OPTIONS
-f, --force

#+begin_quote
Update the info files from scratch.

#+end_quote

* OUTPUT
Currently the command updates the following files. Please see
*gitrepository-layout*(5) for a description of what they are for:

#+begin_quote
·

objects/info/packs

#+end_quote

#+begin_quote
·

info/refs

#+end_quote

* GIT
Part of the *git*(1) suite
